Revit 2024 API
LogicalAndFilter Members
The LogicalAndFilter type exposes the following members.
Constructors
Name | Description
LogicalAndFilter(IList<ElementFilter>)
 Constructs a new instance of the logical filter with any number of input filters.
LogicalAndFilter(ElementFilter, ElementFilter)
 Constructs a new instance of the logical filter with two input filters.
Methods
Name | Description
Dispose |  (Inherited from ElementFilter.)
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetFilters
 Returns an array of copies of the filters that are logically combined by this ElementLogicalFilter.
 (Inherited from ElementLogicalFilter.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
PassesFilter(Element)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
PassesFilter(Document, ElementId)
 Applies the filter to a given element.
 (Inherited from ElementFilter.)
SetFilters
 Replaces current filters in the logical filter with any number of input filters.
 (Inherited from ElementLogicalFilter.)
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
Inverted
 True if the results of the filter are inverted; elements that would normally be accepted by this filter will be rejected, and elements that would normally be rejected will be accepted.
 (Inherited from ElementFilter.)
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
 (Inherited from ElementFilter.)
See Also
LogicalAndFilter Class
Autodesk.Revit.DB Namespace